interface country {
    id: number,
    country: string
}

/*
    Just exports mock array of objects that contains properties country and id. Used to filter films
*/

export const countries: country[] = [
    {
        "country": "Україна ",
        "id": 106
    },
    {
        "country": "США",
        "id": 1
    },
    {
        "country": "Швейцарія",
        "id": 2
    },
    {
        "country": "Франція",
        "id": 3
    },
    {
        "country": "Польща",
        "id": 4
    },
    {
        "country": "Великобританія",
        "id": 5
    },
    {
        "country": "Швеція",
        "id": 6
    },
    {
        "country": "Індія",
        "id": 7
    },
    {
        "country": "Іспанія",
        "id": 8
    },
    {
        "country": "Німеччина",
        "id": 9
    },
    {
        "country": "Італія",
        "id": 10
    },
    {
        "country": "Гонконг",
        "id": 11
    },
    {
        "country": "Німеччина (ФРН)",
        "id": 12
    },
    {
        "country": "Австралія ",
        "id": 13
    },
    {
        "country": "Канада ",
        "id": 14
    },
    {
        "country": "Мексика ",
        "id": 15
    },
    {
        "country": "Японія ",
        "id": 16
    },
    {
        "country": "Данія ",
        "id": 17
    },
    {
        "country": "Чехія ",
        "id": 18
    },
    {
        "country": "Ірландія ",
        "id": 19
    },
    {
        "country": "Люксембург ",
        "id": 20
    },
    {
        "country": "Китай ",
        "id": 21
    },
    {
        "country": "Норвегія ",
        "id": 22
    },
    {
        "country": "Нідерланди ",
        "id": 23
    },
    {
        "country": "Аргентина ",
        "id": 24
    },
    {
        "country": "Фінляндія ",
        "id": 25
    },
    {
        "country": "Боснія і Герцеговина",
        "id": 26
    },
    {
        "country": "Австрія",
        "id": 27
    },
    {
        "country": "Тайвань",
        "id": 28
    },
    {
        "country": "Нова Зеландія",
        "id": 29
    },
    {
        "country": "Бразилія",
        "id": 30
    },
    {
        "country": "Чехословаччина",
        "id": 31
    },
    {
        "country": "Мальта",
        "id": 32
    },
    {
        "country": "СРСР",
        "id": 33
    },
    {
        "country": "Югославія",
        "id": 35
    },
    {
        "country": "Португалія",
        "id": 36
    },
    {
        "country": "Румунія",
        "id": 37
    },
    {
        "country": "Хорватія",
        "id": 38
    },
    {
        "country": "ПАР",
        "id": 39
    },
    {
        "country": "Куба",
        "id": 40
    },
    {
        "country": "Колумбія",
        "id": 41
    },
    {
        "country": "Ізраїль",
        "id": 42
    },
    {
        "country": "Намібія",
        "id": 43
    },
    {
        "country": "Туреччина",
        "id": 44
    },
    {
        "country": "Бельгія",
        "id": 45
    },
    {
        "country": "Сальвадор",
        "id": 46
    },
    {
        "country": "Ісландія",
        "id": 47
    },
    {
        "country": "Угорщина",
        "id": 48
    },
    {
        "country": "Корея Південна ",
        "id": 49
    },
    {
        "country": "Ліхтенштейн",
        "id": 50
    },
    {
        "country": "Болгарія",
        "id": 51
    },
    {
        "country": "Філіппіни",
        "id": 52
    },
    {
        "country": "Домінікану",
        "id": 53
    },
    {
        "country": "Марокко",
        "id": 55
    },
    {
        "country": "Таїланд",
        "id": 56
    },
    {
        "country": "Кенія",
        "id": 57
    },
    {
        "country": "Пакистан",
        "id": 58
    },
    {
        "country": "Іран",
        "id": 59
    },
    {
        "country": "Панама",
        "id": 60
    },
    {
        "country": "Аруба",
        "id": 61
    },
    {
        "country": "Ямайка ",
        "id": 62
    },
    {
        "country": "Греція ",
        "id": 63
    },
    {
        "country": "Туніс ",
        "id": 64
    },
    {
        "country": "Киргизстан ",
        "id": 65
    },
    {
        "country": "Пуерто Ріко ",
        "id": 66
    },
    {
        "country": "Казахстан ",
        "id": 67
    },
    {
        "country": "Югославія (ФР) ",
        "id": 68
    },
    {
        "country": "Алжир ",
        "id": 69
    },
    {
        "country": "Німеччина (НДР) ",
        "id": 70
    },
    {
        "country": "Сінгапур ",
        "id": 71
    },
    {
        "country": "Словаччина ",
        "id": 72
    },
    {
        "country": "Афганістан ",
        "id": 73
    },
    {
        "country": "Індонезія ",
        "id": 74
    },
    {
        "country": "Перу ",
        "id": 75
    },
    {
        "country": "Бермуди ",
        "id": 76
    },
    {
        "country": "Монако ",
        "id": 77
    },
    {
        "country": "Зімбабве ",
        "id": 78
    },
    {
        "country": "В'єтнам ",
        "id": 79
    },
    {
        "country": "Ант ільські Острови",
        "id": 80
    },
    {
        "country": "Саудівська Аравія",
        "id": 81
    },
    {
        "country": "Танзанія",
        "id": 82
    },
    {
        "country": "Лівія",
        "id": 83
    },
    {
        "country": "Ліван",
        "id": 84
    },
    {
        "country": "Кувейт",
        "id": 85
    },
    {
        "country": "Єгипет",
        "id": 86
    },
    {
        "country": "Литва",
        "id": 87
    },
    {
        "country": "Венесуела",
        "id": 88
    },
    {
        "country": "Словенія",
        "id": 89
    },
    {
        "country": "Чилі",
        "id": 90
    },
    {
        "country": "Багами",
        "id": 91
    },
    {
        "country": "Еквадор",
        "id": 92
    },
    {
        "country": "Коста-Ріка",
        "id": 93
    },
    {
        "country": "Кіпр",
        "id": 94
    },
    {
        "country": "Уругвай",
        "id": 95
    },
    {
        "country": "Ірак",
        "id": 96
    },
    {
        "country": "Мартініка",
        "id": 97
    },
    {
        "country": "Естонія",
        "id": 98
    },
    {
        "country": "ОАЕ",
        "id": 99
    },
    {
        "country": "Бангладеш",
        "id": 100
    },
    {
        "country": "Македонія",
        "id": 101
    },
    {
        "country": "Гвінея",
        "id": 102
    },
    {
        "country": "Йорданія",
        "id": 103
    },
    {
        "country": "Латвія ",
        "id": 104
    },
    {
        "country": "Вірменія ",
        "id": 105
    },
    {
        "country": "Сирія ",
        "id": 107
    },
    {
        "country": "Шрі-Ланка ",
        "id": 108
    },
    {
        "country": "Нігерія ",
        "id": 109
    },
    {
        "country": "Берег Слонової кістки ",
        "id": 110
    },
    {
        "country": "Грузія ",
        "id": 111
    },
    {
        "country": "Сенегал ",
        "id": 112
    },
    {
        "country": "Монголія ",
        "id": 113
    },
    {
        "country": "Габон ",
        "id": 114
    },
    {
        "country": "Замбія ",
        "id": 115
    },
    {
        "country": "Албанія",
        "id": 116
    },
    {
        "country": "Камерун",
        "id": 117
    },
    {
        "country": "Буркіна-Фасо",
        "id": 118
    },
    {
        "country": "Узбекистан",
        "id": 119
    },
    {
        "country": "Малайзія",
        "id": 120
    },
    {
        "country": "Сербія",
        "id": 121
    },
    {
        "country": "Гана",
        "id": 122
    },
    {
        "country": "Таджикистан",
        "id": 123
    },
    {
        "country": "Гаїті",
        "id": 124
    },
    {
        "country": "Конго (ДРК)",
        "id": 125
    },
    {
        "country": "Білорусь ",
        "id": 128
    },
    {
        "country": "Молдова ",
        "id": 129
    },
    {
        "country": "Азербайджан ",
        "id": 130
    },
    {
        "country": "Палестина ",
        "id": 131
    },
    {
        "country": "Окупована Палестинська територія ",
        "id": 132
    },
    {
        "country": "Корея Північна ",
        "id": 133
    },
    {
        "country": "Нікарагуа ",
        "id": 134
    },
    {
        "country": "Камбоджа ",
        "id": 135
    },
    {
        "country": "Ангола ",
        "id": 136
    },
    {
        "country": "Сербія і Чорногорія ",
        "id": 137
    },
    {
        "country": "Непал ",
        "id": 138
    },
    {
        "country": "Бенін ",
        "id": 139
    },
    {
        "country": "Гваделупа ",
        "id": 140
    },
    {
        "country": "Гренландія ",
        "id": 141
    },
    {
        "country": "Гвінея-Бісау ",
        "id": 142
    },
    {
        "country": "Макао ",
        "id": 143
    },
    {
        "country": "Парагвай ",
        "id": 144
    },
    {
        "country": "Мавританія ",
        "id": 145
    },
    {
        "country": "Руанда ",
        "id": 146
    },
    {
        "country": "Кот-д'Івуар",
        "id": 148
    },
    {
        "country": "Гібралтар",
        "id": 149
    },
    {
        "country": "Ботсвана",
        "id": 150
    },
    {
        "country": "Болівія",
        "id": 151
    },
    {
        "country": "Мадагаскар",
        "id": 152
    },
    {
        "country": "Кабо-Верде",
        "id": 153
    },
    {
        "country": "Чад",
        "id": 154
    },
    {
        "country": "Малі",
        "id": 155
    },
    {
        "country": "Фіджі",
        "id": 156
    },
    {
        "country": "Бутан",
        "id": 157
    },
    {
        "country": "Барбадос ",
        "id": 158
    },
    {
        "country": "Трінідад і Тобаго",
        "id": 159
    },
    {
        "country": "Мозамбік",
        "id": 160
    },
    {
        "country": "Заїр",
        "id": 161
    },
    {
        "country": "Андорра",
        "id": 162
    },
    {
        "country": "Туркменістан",
        "id": 163
    },
    {
        "country": "Гайана",
        "id": 164
    },
    {
        "country": "Корея",
        "id": 165
    },
    {
        "country": "Нігер",
        "id": 166
    },
    {
        "country": "Конго",
        "id": 167
    },
    {
        "country": "Того",
        "id": 168
    },
    {
        "country": "Ватикан",
        "id": 169
    },
    {
        "country": "Бурунді",
        "id": 171
    },
    {
        "country": "Папуа - Нова Гвінея",
        "id": 172
    },
    {
        "country": "Бахрейн",
        "id": 173
    },
    {
        "country": "Гондурас",
        "id": 174
    },
    {
        "country": "Судан",
        "id": 175
    },
    {
        "country": "Ефіопія",
        "id": 176
    },
    {
        "country": "Ємен",
        "id": 177
    },
    {
        "country": "В'єтнам Північний",
        "id": 178
    },
    {
        "country": "Сурінам",
        "id": 179
    },
    {
        "country": "Маврикій",
        "id": 180
    },
    {
        "country": "Ліберія ",
        "id": 182
    },
    {
        "country": "Лесото ",
        "id": 183
    },
    {
        "country": "Уганда ",
        "id": 184
    },
    {
        "country": "Кайманові острови ",
        "id": 185
    },
    {
        "country": "Антигуа і Барбуда ",
        "id": 186
    },
    {
        "country": "Західна Сахара ",
        "id": 187
    },
    {
        "country": "Сан-Марино ",
        "id": 188
    },
    {
        "country": "Гуам ",
        "id": 189
    },
    {
        "country": "Косово ",
        "id": 190
    },
    {
        "country": "Лаос ",
        "id": 191
    },
    {
        "country": "Катар ",
        "id": 192
    },
    {
        "country": "Оман ",
        "id": 193
    },
    {
        "country": "Американські Віргінські острови ",
        "id": 194
    },
    {
        "country": "Сіам ",
        "id": 195
    },
    {
        "country": "Сьєрра-Леоне ",
        "id": 196
    },
    {
        "country": "Еритрея ",
        "id": 197
    },
    {
        "country": "Сомалі ",
        "id": 198
    },
    {
        "country": "Домініка ",
        "id": 199
    },
    {
        "country": "Бірма ",
        "id": 200
    },
    {
        "country": "Реюньйон ",
        "id": 201
    },
    {
        "country": "Федеративні Штати Мікронезії ",
        "id": 202
    },
    {
        "country": "Ам ериканське Самоа ",
        "id": 204
    },
    {
        "country": "Свазіленд ",
        "id": 205
    },
    {
        "country": "Французька Полінезія ",
        "id": 206
    },
    {
        "country": "М'янма ",
        "id": 207
    },
    {
        "country": "Нова Каледонія ",
        "id": 208
    },
    {
        "country": "Французька Гвіана ",
        "id": 209
    },
    {
        "country": "Сент-Вінсент і Гренадини ",
        "id": 210
    },
    {
        "country": "Малаві ",
        "id": 211
    },
    {
        "country": "Тувалу",
        "id": 215
    },
    {
        "country": "Тимор-Лесте",
        "id": 216
    },
    {
        "country": "ЦАР",
        "id": 217
    },
    {
        "country": "Тонга",
        "id": 218
    },
    {
        "country": "Гренада",
        "id": 219
    },
    {
        "country": "Гамбія",
        "id": 220
    },
    {
        "country": "Антарктида",
        "id": 221
    },
    {
        "country": "Острови Кука",
        "id": 222
    },
    {
        "country": "Острів Мен",
        "id": 223
    },
    {
        "country": "Маршаллові острови ",
        "id": 226
    },
    {
        "country": "Бруней-Даруссалам ",
        "id": 227
    },
    {
        "country": "Сейшельські острови ",
        "id": 228
    },
    {
        "country": "Палау ",
        "id": 229
    },
    {
        "country": "Сент-Люсія ",
        "id": 230
    },
    {
        "country": "Вануату ",
        "id": 231
    },
    {
        "country": "Мальдіви ",
        "id": 232
    },
    {
        "country": "Боснія ",
        "id": 233
    },
    {
        "country": "Киргизія ",
        "id": 236
    },
    {
        "country": "Джибуті ",
        "id": 239
    },
    {
        "country": "Віргінські острови (США) ",
        "id": 240
    },
    {
        "country": "Північна Македонія ",
        "id": 241
    },
    {
        "country": "Віргінські острови (Великобританія) ",
        "id": 242
    },
    {
        "country": "Сент-Люсія ",
        "id": 3545269
    },
    {
        "country": "Фолклендськіострови ",
        "id": 7801402
    },
    {
        "country": "Острів Святої Олени ",
        "id": 10842163
    },
    {
        "country": "острови Теркс і Кайкос ",
        "id": 32518739
    }
]