interface genre {
    id: number,
    genre: string
}

export const genres: genre[] = [
    {
        "id": 1,
        "genre": "триллер"
    },
    {
        "id": 2,
        "genre": "драма"
    },
    {
        "id": 3,
        "genre": "кримінал"
    },
    {
        "id": 4,
        "genre": "мелодрама"
    },
    {
        "id": 5,
        "genre": "детектив"
    },
    {
        "id": 6,
        "genre": "фантастика"
    },
    {
        "id": 7,
        "genre": "пригоди"
    },
    {
        "id": 8,
        "genre": "біографія"
    },
    {
        "id": 9,
        "genre": "фільм-нуар"
    },
    {
        "id": 10,
        "genre": "вестерн"
    },
    {
        "id": 11,
        "genre": "бойовик"
    },
    {
        "id": 12,
        "genre": "фентезі"
    },
    {
        "id": 13,
        "genre": "комедія"
    },
    {
        "id": 14,
        "genre": "військовий"
    },
    {
        "id": 15,
        "genre": "історія"
    },
    {
        "id": 16,
        "genre": "музика"
    },
    {
        "id": 17,
        "genre": "фільм жахів"
    },
    {
        "id": 18,
        "genre": "мультфільм"
    },
    {
        "id": 19,
        "genre": "сімейний"
    },
    {
        "id": 20,
        "genre": "мюзикл"
    },
    {
        "id": 21,
        "genre": "спорт"
    },
    {
        "id": 22,
        "genre": "документальний"
    },
    {
        "id": 23,
        "genre": "короткометражка"
    },
    {
        "id": 24,
        "genre": "аніме"
    },
    {
        "id": 26,
        "genre": "новини"
    },
    {
        "id": 27,
        "genre": "концерт"
    },
    {
        "id": 28,
        "genre": "для дорослих"
    },
    {
        "id": 29,
        "genre": "церемонія"
    },
    {
        "id": 30,
        "genre": "реальне ТБ"
    },
    {
        "id": 31,
        "genre": "гра"
    },
    {
        "id": 32,
        "genre": "ток-шоу"
    },
    {
        "id": 33,
        "genre": "для дітей"
    }
]